Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#no ip domain-lookup
R1(config)#interface g0/0
R1(config-if)#ip address 10.30.22.1 255.255.255.192
R1(config-if)#no shut

R1(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

R1(config-if)#interface s0/0/0
R1(config-if)#ip address 10.30.22.97 255.255.255.248
R1(config-if)#clock rate 64000
R1(config-if)#no shut

%LINK-5-CHANGED: Interface Serial0/0/0, changed state to down
R1(config-if)#int s0/0/1
R1(config-if)#ip address 10.30.22.138 255.255.255.248
R1(config-if)#no shut

%LINK-5-CHANGED: Interface Serial0/0/1, changed state to down
R1(config-if)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#Copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip route 10.30.22.64 255.255.255.224 10.30.22.98
R1(config)#ip route 10.30.16.0 255.255.252.0 10.30.22.98
R1(config)#ip route 10.30.20.0 255.255.254.0 10.30.22.137
R1(config)#ip route 10.30.8.0 255.255.248.0 10.30.22.137
R1(config)#ip route 10.30.0.0 255.255.248.0 10.30.22.137
R1(config)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#